Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: The text with changes is still there, but you can't see it.
es_es: El texto con los cambios está todavía aquí, pero no lo puede ver.

source: This is further explained in section |22.4|: The buffer list.
es_es: Esto se explica con más detalle en la sección |22.4|: La lista de búfers.

source: You can start Vim to edit a sequence of files.
es_es: Puede iniciar Vim para editar una secuencia de archivos.

source: This command starts Vim and tells it that you will be editing three files.
es_es: Esta orden inicia Vim y le dice que va a editar tres archivos.

source: Vim displays just the first file.
es_es: Vim muestra solamente el primero.

source: After you have done your thing in this file, to edit the next file you use this command: >
es_es: Tras haber terminado con el primero, puede editar el siguiente con esta orden: >

source: If you have unsaved changes in the current file, you will get an error message and the ":next" will not work.
es_es: Si tiene cambios sin guardar en el archivo actual, obtendrá un mensaje de error y «:next» no funcionará.

source: This is the same problem as with ":edit" mentioned in the previous section.
es_es: Este es el mismo problema mencionado con «:edit» en la sección anterior.

source: To abandon the changes: >
es_es: Para abandonar los cambios: >

source: But mostly you want to save the changes and move on to the next file.
es_es: Pero habitualmente querrá guardar los cambios e ir al siguiente archivo.

source: There is a special command for this: >
es_es: Hay una orden especial para esto: >

source: To see which file in the argument list you are editing, look in the window title.
es_es: Para ver qué archivo de la lista de argumentos está editando, mire en el título de la ventana.

source: It should show something like "(2 of 3)".
es_es: Debería mostrar algo como «(2 de 3)».

source: This means you are editing the second file out of three files.
es_es: Esto significa que está editando un segundo archivo de una lista de tres.

source: If you want to see the list of files, use this command: >
es_es: Si quieres ver la lista de archivos, use esta orden: >

source: This is short for "arguments".
es_es: Esta es la abreviatura de «argumentos».

source: The output might look like this:
es_es: La salida será algo así:

source: These are the files you started Vim with.
es_es: Estos son los archivos con los que ha iniciado Vim.

source: The one you are currently editing, "two.c", is in square brackets.
es_es: El que está editando actualmente, «dos.c», se encuentra entre corchetes.

source: This is just like the ":next" command, except that it moves in the other direction.
es_es: Esto es justo como la orden «:next», excepto que va en la otra dirección.

source: Again, there is a shortcut command for when you want to write the file first: >
es_es: Una vez más, existe una orden para cuando quiera escribir el archivo primero: >

source: You can use a count for ":next" and ":previous".
es_es: Puede usar un multiplicador para «:next» y «:previous».

source: To skip two files forward: >
es_es: Para saltar dos archivos: >

source: When moving around the files and making changes, you have to remember to use ":write".
es_es: Cuando se mueva por los archivos y haga cambios, tiene que recordar usar «:write».

source: Otherwise you will get an error message.
es_es: En caso contrario, obtendrá mensajes de error.

source: If you are sure you always want to write modified files, you can tell Vim to automatically write them: >
es_es: Si está seguro de que siempre va a escribir los archivos modificados, puede decirle a Vim que los escriba automáticamente: >

source: You can redefine the list of files without the need to exit Vim and start it again.
es_es: Puede redefinir la lista de archivos sin la necesidad de salir de Vim y arrancarlo de nuevo.

source: Use this command to edit three other files: >
es_es: Emplee esta orden para editar otros tres archivos: >

source: Vim will take you to the first file in the list.
es_es: Vim le llevará al primer archivo en la lista.

source: Again, if the current file has changes, you can either write the file first, or use ":args!" (with ! added) to abandon the changes.
es_es: De nuevo, si el archivo actual cambia, puede tanto guardar el archivo antes como usar «:args!» (con el ! añadido) para abandonar los cambios.

source: DID YOU EDIT THE LAST FILE?
es_es: ¿HA EDITADO EL HASTA EL ÚLTIMO ARCHIVO?

source: *arglist-quit* When you use a list of files, Vim assumes you want to edit them all.
es_es: *arglist-quit* Cuando usa una lista de archivos, Vim asume que quiere editarlos todos.

source: To protect you from exiting too early, you will get this error when you didn't edit the last file in the list yet:
es_es: Para evitar cerrar antes de tiempo, obtendrá un error cuando no haya editado el último archivo en la lista e intentes salir.

source: If you really want to exit, just do it again.
es_es: Si realmente desea salir, simplemente inténtelo de nuevo.

source: Then it will work (but not when you did other commands in between).
es_es: Entonces funcionará (pero no si ejecuta otras órdenes durante).

source: To quickly jump between two files, press CTRL-^ (on English-US keyboards the ^ is above the 6 key).
es_es: Para saltar rápidamente entre dos archivos, pulse CTRL-^ (en teclados Inglés-EEUU el ^ se encuentra encima de la tecla 6).

source: Now you are in two.c.
es_es: Ahora está en two.c.

source: Now use CTRL-^ to go back to one.c.
es_es: Use CTRL-^ para volver a uno.c.

source: Another CTRL-^ and you are back in two.c.
es_es: Use CTRL-^ otra vez y estará de vuelta en dos.c.

source: Another CTRL-^ and you are in one.c again.
es_es: Otro CTRL-^ y estará en uno.c de nuevo.

source: If you now do: >
es_es: Si ahora hace: >

source: You are in three.c.
es_es: Está en tres.c.

source: Notice that the CTRL-^ command does not change the idea of where you are in the list of files.
es_es: Observe que la orden CTRL-^ no cambia la idea de dónde está en la lista de archivos.

source: Only commands like ":next" and ":previous" do that.
es_es: Sólo órdenes como «:next» y «:previous» lo hacen.

source: The file you were previously editing is called the "alternate" file.
es_es: El archivo que haya estado editando anteriormente se llama el archivo «alterno».

source: When you just started Vim CTRL-^ will not work, since there isn't a previous file.
es_es: Hasta que no haya un archivo anterior, CTRL-^ no funcionará.

source: This takes you to the position where the cursor was when you left the file.
es_es: Esto le lleva a la posición en la que estaba el cursor cuando salió del archivo.

source: Another mark that is remembered is the position where you made the last change: >
es_es: Otra marca que se recuerda es la posición donde hizo el último cambio: >

source: Suppose you are editing the file "one.txt".
es_es: Suponga que está editando el archivo «uno».

source: Somewhere halfway the file you use "x" to delete a character.
es_es: En algún lugar a mitad de camino en el archivo, use «x» para eliminar un carácter.

source: Then you go to the last line with "G" and write the file with ":w".
es_es: Vaya ahora a la última línea con «G» y escriba el archivo con «:w».

source: You edit several other files, and then use ":edit one.txt" to come back to "one.txt".
es_es: Edite otros archivos y use «:edit uno.txt» para volver a «uno.txt».

source: If you now use `" Vim jumps to the last line of the file.
es_es: Si ahora usa `", Vim saltará a la última línea del archivo.

source: Using `. takes you to the position where you deleted the character.
es_es: Usar `. le llevará a la posición donde eliminó el carácter.

source: Even when you move around in the file `" and `. will take you to the remembered position.
es_es: Incluso cuando se mueva por el archivo, `" y `. le llevará a la posición recordada.

source: At least until you make another change or leave the file.
es_es: Al menos hasta que realice otro cambio o salga del archivo.

source: Now you can use the "'F" command to jump back to halfway foo.txt.
es_es: Ahora puede usar la orden «'F» para saltar al punto marcado de foo.txt.

source: Or edit yet another file, type "'B" and you are at the end of bar.txt again.
es_es: O edite otro archivo, escriba «'B» y estará en el final de bar.txt de nuevo.

source: The file marks are remembered until they are placed somewhere else.
es_es: Estas marcas de archivo se recordarán hasta que se coloquen en algún otro lugar.

source: Thus you can place the mark, do hours of editing and still be able to jump back to that mark.
es_es: Así podrás colocar los marcadores, trabajar durante horas y aún tendrá la posibilidad de volver al punto marcado.

source: It's often useful to think of a simple connection between the mark letter and where it is placed.
es_es: Es útil pensar en una conexión sencilla entre la letra del marcador y el lugar donde se coloca.

source: For example, use the H mark in a header file, M in a Makefile and C in a C code file.
es_es: Por ejemplo, use la letra H para un archivo de cabecera (*.h), M para un Makefile y C para código C.

source: Usually Vim does not produce a backup file.
es_es: Habitualmente, Vim no produce copias de seguridad.

source: If you want to have one, all you need to do is execute the following command: >
es_es: Si desea que lo haga,lo único que tiene que hacer es ejecutar la siguiente orden: >

source: The name of the backup file is the original file with a ~ added to the end.
es_es: El nombre del archivo de seguridad es el original con un ~ añadido al final.

source: If your file is named data.txt, for example, the backup file name is data.txt~.
es_es: Si su archivo se llama datos.txt, por ejemplo, el archivo de seguridad será datos.txt~.

source: If you do not like the fact that the backup files end with ~, you can change the extension: >
es_es: Si no le gusta el hecho de que las copias de seguridad terminen con ~, puedes cambiar la extensión: >

source: This will use data.txt.bak instead of data.txt~.
es_es: Esto hará que Vim use datos.txt.bak en lugar de datos.txt~.

source: Another option that matters here is 'backupdir'.
es_es: Otra opción que resulta importante aquí es 'backupdir'.

source: It specifies where the backup file is written.
es_es: Especifica dónde se guardará el archivo de seguridad.

source: The default, to write the backup in the same directory as the original file, will mostly be the right thing.
es_es: La opción por omisión, escribir la copia de seguridad en el mismo directorio, es habitualmente la mejor.

source: Note: When the 'backup' option isn't set but the 'writebackup' is, Vim will still create a backup file.
es_es: Nota: Cuando la opción 'backup' no está activada pero 'writebackup' lo está, Vim creará igualmente la copia de seguridad.

source: However, it is deleted as soon as writing the file was completed successfully.
es_es: Sin embargo, se eliminará tan pronto como se escriba el archivo con éxito.

source: This functions as a safety against losing your original file when writing fails in some way (disk full is the most common cause; being hit by lightning might be another, although less common).
es_es: Esto funciona como seguridad ante la pérdida de su archivo original cuando la escritura falla por algún motivo (un disco lleno es el más habitual, un rayo puede ser otra causa aunque menos común).

source: If you are editing source files, you might want to keep the file before you make any changes.
es_es: Si está editando archivos fuente, quizá desee mantener el archivo antes de hacer ningún cambio.

source: But the backup file will be overwritten each time you write the file.
es_es: Pero la copia de seguridad se sobreescribirá cada vez que escriba el archivo.

source: Thus it only contains the previous version, not the first one.
es_es: Así sólo contendrá la versión previa y no la original.

source: To make Vim keep the original file, set the 'patchmode' option.
es_es: Para hacer que Vim mantenga el archivo original, activa la opción 'patchmode'.

source: This specifies the extension used for the first backup of a changed file.
es_es: Esto especifica la extensión usada para la primera copia de seguridad de un archivo modificado.

source: Usually you would do this: >
es_es: Habitualmente harás esto: >

source: When you now edit the file data.txt for the first time, make changes and write the file, Vim will keep a copy of the unchanged file under the name "data.txt.orig".
es_es: Cuando edite el archivo datos.txt por primera vez, haga cambios y guarde el archivo, Vim mantendrá una copia del archivo sin cambios bajo el nombre «datos.txt.orig».

source: If you make further changes to the file, Vim will notice that "data.txt.orig" already exists and leave it alone.
es_es: Si hace más cambios, Vim notará que «datos.txt.orig» ya existe y lo dejará en paz.

source: Further backup files will then be called "data.txt~" (or whatever you specified with 'backupext').
es_es: El resto de copias de seguridad se llamarán «datos.txt~» (o lo que haya especificado con 'backupext').

source: If you leave 'patchmode' empty (that is the default), the original file will not be kept.
es_es: Si deja 'patchmode' vacío (la opción por defecto), el archivo original no se guardará.

source: Now edit the file you want to put the text in.
es_es: Edite ahora el archivo donde desea poner el texto.

source: Move the cursor to the character where you want the text to appear after.
es_es: Mueva el cursor al caracter donde quiera que el texto se coloque a continuación.

source: Use "p" to put the text there.
es_es: Use «p» para poner el texto allí.

source: > :edit otherfile /There p
es_es: > :edit otroarchivo /Allí p

source: Of course you can use many other commands to yank the text.
es_es: Naturalmente, podrás usar cualquiera otra orden de copia.

source: For example, to select whole lines start Visual mode with "V".
es_es: Por ejemplo, para seleccionar líneas completas, inicie el modo Visual con «V».

source: Or use CTRL-V to select a rectangular block.
es_es: O pulse CTRL-V para seleccionar bloques rectangulares.

source: Or use "Y" to yank a single line, "yaw" to yank-a-word, etc.
es_es: Puede usar «Y» para simplemente copiar una línea, «yaw» para pegar una palabra (yank-a-word).

source: The "p" command puts the text after the cursor.
es_es: La orden «p» pone el texto después del cursor.

source: Use "P" to put the text before the cursor.
es_es: Use «P» para pegarlo antes del cursor.

source: Notice that Vim remembers if you yanked a whole line or a block, and puts it back that way.
es_es: Repare en el hecho de que Vim recuerda si ha copiado una línea completa o un bloque y lo pondrá del mismo modo.

source: When you want to copy several pieces of text from one file to another, having to switch between the files and writing the target file takes a lot of time.
es_es: Cuando quiera copiar diversas porciones de un texto de un archivo a otro, tener que cambiar entre los archivos y guardarlos lleva mucho tiempo.

source: To avoid this, copy each piece of text to its own register.
es_es: Para evitar esto, copie cada porción en un registro independiente.

source: A register is a place where Vim stores text.
es_es: Un registro es un lugar donde Vim guarda texto.

source: Here we will use the registers named a to z (later you will find out there are others).
es_es: Aquí usaremos los registros nombrados desde la «a» a la «z» (más tarde se percatará de que hay otros).

source: Let's copy a sentence to the f register (f for First): >
es_es: Vamos a copiar una frase en el registro f: >

source: The "yas" command yanks a sentence like before.
es_es: La orden «yas» copia una frase.

source: It's the "f that tells Vim the text should be place in the f register.
es_es: Es el «"f» el que le dice a Vim que el texto se debe situar en el registro f.

source: This must come just before the yank command.
es_es: Esto debe aparecer justo antes de la orden copiar.

source: Now yank three whole lines to the l register (l for line): >
es_es: Ahora copie tres líneas completas en el registro l: >

source: The count could be before the "l just as well.
es_es: El multiplicador puede situarse también antes del «"l».

source: To yank a block of text to the b (for block) register: >
es_es: Para copiar un bloque de texto al registro b: >

source: Notice that the register specification "b is just before the "y" command.
es_es: Observe que la especificación del registro «"b» se encuentra justo antes de la orden «y».

source: This is required.
es_es: Esto es imprescindible.

source: If you would have put it before the "w" command, it would not have worked.
es_es: Si lo hubierse puesto antes de la orden «w», no habría funcionado.

source: Now you have three pieces of text in the f, l and b registers.
es_es: Ahora tiene tres porciones de texto en los registros f, l, y b.

source: Edit another file, move around and place the text where you want it: >
es_es: Edite otro archivo, desplácese por el texto y allá donde desee: >

source: When you delete text, you can also specify a register.
es_es: Cuando elimine texto, también puedes especificar un registro.

source: Use this to move several pieces of text around.
es_es: Use esto para mover varias porciones de texto de un lado para otro.

source: For example, to delete-a-word and write it in the w register: >
es_es: Por ejemplo, para eliminar una palabra y ponerla en el registro w (delete-a-word): >

source: Sometimes you only want to see what a file contains, without the intention to ever write it back.
es_es: A veces sólo quiere ver qué contiene un archivo, sin la intención de guardar ningún cambio.

source: There is the risk that you type ":w" without thinking and overwrite the original file anyway.
es_es: Existe el riesgo de que escribas «:w» sin pensar y sobreescriba el archivo original.

source: To avoid this, edit the file read-only.
es_es: Para evitar esto, edite el archivo como sólo lectura.

source: To start Vim in readonly mode, use this command: >
es_es: Para ejecutar Vim en modo sólo lectura, haga lo siguiente: >

source: You are now editing "file" in read-only mode.
es_es: Ahora está editando «archivo» en modo sólo lectura.

source: When you try using ":w" you will get an error message and the file won't be written.
es_es: Cuando pruebe a usar «:w» se dará cuenta de que aparecerá un mensaje de error y no se guardará.

source: When you try to make a change to the file Vim will give you a warning:
es_es: Cuando intente hacer un cambio al archivo, Vim le dará un aviso:

source: The change will be done though.
es_es: El cambio se realizará igualmente.

source: This allows for formatting the file, for example, to be able to read it easily.
es_es: Esto permite formatear el archivo, por ejemplo, para facilitar su lectura.

source: If you make changes to a file and forgot that it was read-only, you can still write it.
es_es: Si intenta hacer cambios a un archivo y olvidas que era de sólo lectura, aún podrá guardarlo.

source: Add the ! to the write command to force writing.
es_es: Añada «!» a la orden guardar para forzar la escritura.

source: Now every attempt to change the text will fail.
es_es: Ahora, cualquier intento de cambiar el texto fallará.

source: The help files are like this, for example.
es_es: Los archivos de ayuda son así, por ejemplo.

source: If you try to make a change you get this error message:
es_es: Si intenta cambiar algo, obtendrá el siguiente error:

source: A clever way to start editing a new file is by using an existing file that contains most of what you need.
es_es: Una forma inteligente de comenzar la edición de un archivo nuevo es usar un archivo similar de partida que contenga algo parecido.

source: For example, you start writing a new program to move a file.
es_es: Por ejemplo, empiece a escribir un programa para filtrar archivos.

source: You know that you already have a program that copies a file, thus you start with: >
es_es: Sabe que ya tiene un código que copia archivos, así que podría comenzar con él: >

source: You can delete the stuff you don't need.
es_es: Puede eliminar lo que no necesita.

source: Now you need to save the file under a new name.
es_es: A continuación tendrá que guardar el archivo bajo un nombre distinto.

source: The ":saveas" command can be used for this: >
es_es: La orden «:saveas» es adecuado para esto: >

source: Vim will write the file under the given name, and edit that file.
es_es: Vim escribirá el archivo con el nuevo nombre y editará el nuevo archivo.

source: Thus the next time you do ":write", it will write "move.c".
es_es: Así la próxima vez que haga «:write», escribirá «filtrar.c».

source: "copy.c" remains unmodified.
es_es: «copiar.c» se mantiene sin modificaciones.

source: When you want to change the name of the file you are editing, but don't want to write the file, you can use this command: >
es_es: Cuando desee cambiar el nombre del archivo que está editando pero no quiere escribirlo, puede usar el siguiente orden: >

source: Vim will mark the file as "not edited".
es_es: Vim marcará el archivo como «no editado».

source: This means that Vim knows this is not the file you started editing.
es_es: Esto significa que Vim sabe que este no es el archivo que comenzó a editar.

source: When you try to write the file, you might get this message:
es_es: Cuando intente guardar el archivo, puede que vea el siguiente mensaje:

source: *usr_41.txt* For Vim version 7.3.
es_es: *usr_41.esx* Para Vim versión 7.3.

source: The Vim script language is used for the startup vimrc file, syntax files, and many other things.
es_es: El lenguaje de programación de Vim se usa en el archivo de arranque vimrc, los archivos de sintaxis, y muchas otras cosas.

source: This chapter explains the items that can be used in a Vim script.
es_es: Este capítulo presenta y explica en detalle los elementos que componen un script de Vim.

source: There are a lot of them, thus this is a long chapter.
es_es: Hay muchos de ellos, por lo que éste es un capítulo largo.

source: :let i = 1 :while i < 5 : echo "count is" i : let i += 1 :endwhile < Note: The ":" characters are not really needed here.
es_es: :let i = 1 :while i < 5 : echo "cuenta es" i : let i += 1 :endwhile < Nota: En realidad en el ejemplo de arriba los caracteres «:» no son necesarios.

source: You only need to use them when you type a command.
es_es: Sólo es necesario su uso al escribir una orden.

source: In a Vim script file they can be left out.
es_es: En los archivos de script de Vim es posible omitirlos.

source: We will use them here anyway to make clear these are colon commands and make them stand out from Normal mode commands.
es_es: Aquí se muestran para evidenciar que son órdenes de la línea de órdenes, y no órdenes del modo Normal.

source: Note: You can try out the examples by yanking the lines from the text here and executing them with :@"
es_es: Nota: Puede probar los ejemplos que se muestran aquí copiando el texto correspondiente, y ejecutándolo con la orden «:@"»

source: In the first line the ":let" command assigns a value to a variable.
es_es: En la primera línea la orden «:let» le asigna un valor a una variable.

source: In this case the variable name is "i" and the expression is a simple value, the number one.
es_es: En este caso el nombre de la variable es «i» y la expresión es simplemente un valor, el número uno.

source: The ":while" command starts a loop.
es_es: La orden «:while» inicia un ciclo.

source: The statements until the matching ":endwhile" are executed for as long as the condition is true.
es_es: Las instrucciones hasta el «:endwhile» correspondiente se ejecutan mientras que la {condicion} se siga cumpliendo.

source: The condition used here is the expression "i < 5".
es_es: La condición aquí es la expresión «i < 5».
